Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(1024, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
conv2d_116 (Conv2D)             (1024, 32, 32, 16)   448         input_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_110 (BatchN (1024, 32, 32, 16)   64          conv2d_116[0][0]                 
__________________________________________________________________________________________________
activation_110 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_110[0][0]    
__________________________________________________________________________________________________
conv2d_117 (Conv2D)             (1024, 32, 32, 16)   272         activation_110[0][0]             
__________________________________________________________________________________________________
batch_normalization_111 (BatchN (1024, 32, 32, 16)   64          conv2d_117[0][0]                 
__________________________________________________________________________________________________
activation_111 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_111[0][0]    
__________________________________________________________________________________________________
conv2d_118 (Conv2D)             (1024, 32, 32, 16)   2320        activation_111[0][0]             
__________________________________________________________________________________________________
batch_normalization_112 (BatchN (1024, 32, 32, 16)   64          conv2d_118[0][0]                 
__________________________________________________________________________________________________
activation_112 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_112[0][0]    
__________________________________________________________________________________________________
conv2d_120 (Conv2D)             (1024, 32, 32, 64)   1088        activation_110[0][0]             
__________________________________________________________________________________________________
conv2d_119 (Conv2D)             (1024, 32, 32, 64)   1088        activation_112[0][0]             
__________________________________________________________________________________________________
add_36 (Add)                    (1024, 32, 32, 64)   0           conv2d_120[0][0]                 
                                                                 conv2d_119[0][0]                 
__________________________________________________________________________________________________
batch_normalization_113 (BatchN (1024, 32, 32, 64)   256         add_36[0][0]                     
__________________________________________________________________________________________________
activation_113 (Activation)     (1024, 32, 32, 64)   0           batch_normalization_113[0][0]    
__________________________________________________________________________________________________
conv2d_121 (Conv2D)             (1024, 32, 32, 16)   1040        activation_113[0][0]             
__________________________________________________________________________________________________
batch_normalization_114 (BatchN (1024, 32, 32, 16)   64          conv2d_121[0][0]                 
__________________________________________________________________________________________________
activation_114 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_114[0][0]    
__________________________________________________________________________________________________
conv2d_122 (Conv2D)             (1024, 32, 32, 16)   2320        activation_114[0][0]             
__________________________________________________________________________________________________
batch_normalization_115 (BatchN (1024, 32, 32, 16)   64          conv2d_122[0][0]                 
__________________________________________________________________________________________________
activation_115 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_115[0][0]    
__________________________________________________________________________________________________
conv2d_123 (Conv2D)             (1024, 32, 32, 64)   1088        activation_115[0][0]             
__________________________________________________________________________________________________
add_37 (Add)                    (1024, 32, 32, 64)   0           add_36[0][0]                     
                                                                 conv2d_123[0][0]                 
__________________________________________________________________________________________________
batch_normalization_116 (BatchN (1024, 32, 32, 64)   256         add_37[0][0]                     
__________________________________________________________________________________________________
activation_116 (Activation)     (1024, 32, 32, 64)   0           batch_normalization_116[0][0]    
__________________________________________________________________________________________________
conv2d_124 (Conv2D)             (1024, 32, 32, 16)   1040        activation_116[0][0]             
__________________________________________________________________________________________________
batch_normalization_117 (BatchN (1024, 32, 32, 16)   64          conv2d_124[0][0]                 
__________________________________________________________________________________________________
activation_117 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_117[0][0]    
__________________________________________________________________________________________________
conv2d_125 (Conv2D)             (1024, 32, 32, 16)   2320        activation_117[0][0]             
__________________________________________________________________________________________________
batch_normalization_118 (BatchN (1024, 32, 32, 16)   64          conv2d_125[0][0]                 
__________________________________________________________________________________________________
activation_118 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_118[0][0]    
__________________________________________________________________________________________________
conv2d_126 (Conv2D)             (1024, 32, 32, 64)   1088        activation_118[0][0]             
__________________________________________________________________________________________________
add_38 (Add)                    (1024, 32, 32, 64)   0           add_37[0][0]                     
                                                                 conv2d_126[0][0]                 
__________________________________________________________________________________________________
batch_normalization_119 (BatchN (1024, 32, 32, 64)   256         add_38[0][0]                     
__________________________________________________________________________________________________
activation_119 (Activation)     (1024, 32, 32, 64)   0           batch_normalization_119[0][0]    
__________________________________________________________________________________________________
conv2d_127 (Conv2D)             (1024, 32, 32, 16)   1040        activation_119[0][0]             
__________________________________________________________________________________________________
batch_normalization_120 (BatchN (1024, 32, 32, 16)   64          conv2d_127[0][0]                 
__________________________________________________________________________________________________
activation_120 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_120[0][0]    
__________________________________________________________________________________________________
conv2d_128 (Conv2D)             (1024, 32, 32, 16)   2320        activation_120[0][0]             
__________________________________________________________________________________________________
batch_normalization_121 (BatchN (1024, 32, 32, 16)   64          conv2d_128[0][0]                 
__________________________________________________________________________________________________
activation_121 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_121[0][0]    
__________________________________________________________________________________________________
conv2d_129 (Conv2D)             (1024, 32, 32, 64)   1088        activation_121[0][0]             
__________________________________________________________________________________________________
add_39 (Add)                    (1024, 32, 32, 64)   0           add_38[0][0]                     
                                                                 conv2d_129[0][0]                 
__________________________________________________________________________________________________
batch_normalization_122 (BatchN (1024, 32, 32, 64)   256         add_39[0][0]                     
__________________________________________________________________________________________________
activation_122 (Activation)     (1024, 32, 32, 64)   0           batch_normalization_122[0][0]    
__________________________________________________________________________________________________
conv2d_130 (Conv2D)             (1024, 32, 32, 16)   1040        activation_122[0][0]             
__________________________________________________________________________________________________
batch_normalization_123 (BatchN (1024, 32, 32, 16)   64          conv2d_130[0][0]                 
__________________________________________________________________________________________________
activation_123 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_123[0][0]    
__________________________________________________________________________________________________
conv2d_131 (Conv2D)             (1024, 32, 32, 16)   2320        activation_123[0][0]             
__________________________________________________________________________________________________
batch_normalization_124 (BatchN (1024, 32, 32, 16)   64          conv2d_131[0][0]                 
__________________________________________________________________________________________________
activation_124 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_124[0][0]    
__________________________________________________________________________________________________
conv2d_132 (Conv2D)             (1024, 32, 32, 64)   1088        activation_124[0][0]             
__________________________________________________________________________________________________
add_40 (Add)                    (1024, 32, 32, 64)   0           add_39[0][0]                     
                                                                 conv2d_132[0][0]                 
__________________________________________________________________________________________________
batch_normalization_125 (BatchN (1024, 32, 32, 64)   256         add_40[0][0]                     
__________________________________________________________________________________________________
activation_125 (Activation)     (1024, 32, 32, 64)   0           batch_normalization_125[0][0]    
__________________________________________________________________________________________________
conv2d_133 (Conv2D)             (1024, 32, 32, 16)   1040        activation_125[0][0]             
__________________________________________________________________________________________________
batch_normalization_126 (BatchN (1024, 32, 32, 16)   64          conv2d_133[0][0]                 
__________________________________________________________________________________________________
activation_126 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_126[0][0]    
__________________________________________________________________________________________________
conv2d_134 (Conv2D)             (1024, 32, 32, 16)   2320        activation_126[0][0]             
__________________________________________________________________________________________________
batch_normalization_127 (BatchN (1024, 32, 32, 16)   64          conv2d_134[0][0]                 
__________________________________________________________________________________________________
activation_127 (Activation)     (1024, 32, 32, 16)   0           batch_normalization_127[0][0]    
__________________________________________________________________________________________________
conv2d_135 (Conv2D)             (1024, 32, 32, 64)   1088        activation_127[0][0]             
__________________________________________________________________________________________________
add_41 (Add)                    (1024, 32, 32, 64)   0           add_40[0][0]                     
                                                                 conv2d_135[0][0]                 
__________________________________________________________________________________________________
batch_normalization_128 (BatchN (1024, 32, 32, 64)   256         add_41[0][0]                     
__________________________________________________________________________________________________
activation_128 (Activation)     (1024, 32, 32, 64)   0           batch_normalization_128[0][0]    
__________________________________________________________________________________________________
conv2d_136 (Conv2D)             (1024, 16, 16, 64)   4160        activation_128[0][0]             
__________________________________________________________________________________________________
batch_normalization_129 (BatchN (1024, 16, 16, 64)   256         conv2d_136[0][0]                 
__________________________________________________________________________________________________
activation_129 (Activation)     (1024, 16, 16, 64)   0           batch_normalization_129[0][0]    
__________________________________________________________________________________________________
conv2d_137 (Conv2D)             (1024, 16, 16, 64)   36928       activation_129[0][0]             
__________________________________________________________________________________________________
batch_normalization_130 (BatchN (1024, 16, 16, 64)   256         conv2d_137[0][0]                 
__________________________________________________________________________________________________
activation_130 (Activation)     (1024, 16, 16, 64)   0           batch_normalization_130[0][0]    
__________________________________________________________________________________________________
conv2d_139 (Conv2D)             (1024, 16, 16, 128)  8320        add_41[0][0]                     
__________________________________________________________________________________________________
conv2d_138 (Conv2D)             (1024, 16, 16, 128)  8320        activation_130[0][0]             
__________________________________________________________________________________________________
add_42 (Add)                    (1024, 16, 16, 128)  0           conv2d_139[0][0]                 
                                                                 conv2d_138[0][0]                 
__________________________________________________________________________________________________
batch_normalization_131 (BatchN (1024, 16, 16, 128)  512         add_42[0][0]                     
__________________________________________________________________________________________________
activation_131 (Activation)     (1024, 16, 16, 128)  0           batch_normalization_131[0][0]    
__________________________________________________________________________________________________
conv2d_140 (Conv2D)             (1024, 16, 16, 64)   8256        activation_131[0][0]             
__________________________________________________________________________________________________
batch_normalization_132 (BatchN (1024, 16, 16, 64)   256         conv2d_140[0][0]                 
__________________________________________________________________________________________________
activation_132 (Activation)     (1024, 16, 16, 64)   0           batch_normalization_132[0][0]    
__________________________________________________________________________________________________
conv2d_141 (Conv2D)             (1024, 16, 16, 64)   36928       activation_132[0][0]             
__________________________________________________________________________________________________
batch_normalization_133 (BatchN (1024, 16, 16, 64)   256         conv2d_141[0][0]                 
__________________________________________________________________________________________________
activation_133 (Activation)     (1024, 16, 16, 64)   0           batch_normalization_133[0][0]    
__________________________________________________________________________________________________
conv2d_142 (Conv2D)             (1024, 16, 16, 128)  8320        activation_133[0][0]             
__________________________________________________________________________________________________
add_43 (Add)                    (1024, 16, 16, 128)  0           add_42[0][0]                     
                                                                 conv2d_142[0][0]                 
__________________________________________________________________________________________________
batch_normalization_134 (BatchN (1024, 16, 16, 128)  512         add_43[0][0]                     
__________________________________________________________________________________________________
activation_134 (Activation)     (1024, 16, 16, 128)  0           batch_normalization_134[0][0]    
__________________________________________________________________________________________________
conv2d_143 (Conv2D)             (1024, 16, 16, 64)   8256        activation_134[0][0]             
__________________________________________________________________________________________________
batch_normalization_135 (BatchN (1024, 16, 16, 64)   256         conv2d_143[0][0]                 
__________________________________________________________________________________________________
activation_135 (Activation)     (1024, 16, 16, 64)   0           batch_normalization_135[0][0]    
__________________________________________________________________________________________________
conv2d_144 (Conv2D)             (1024, 16, 16, 64)   36928       activation_135[0][0]             
__________________________________________________________________________________________________
batch_normalization_136 (BatchN (1024, 16, 16, 64)   256         conv2d_144[0][0]                 
__________________________________________________________________________________________________
activation_136 (Activation)     (1024, 16, 16, 64)   0           batch_normalization_136[0][0]    
__________________________________________________________________________________________________
conv2d_145 (Conv2D)             (1024, 16, 16, 128)  8320        activation_136[0][0]             
__________________________________________________________________________________________________
add_44 (Add)                    (1024, 16, 16, 128)  0           add_43[0][0]                     
                                                                 conv2d_145[0][0]                 
__________________________________________________________________________________________________
batch_normalization_137 (BatchN (1024, 16, 16, 128)  512         add_44[0][0]                     
__________________________________________________________________________________________________
activation_137 (Activation)     (1024, 16, 16, 128)  0           batch_normalization_137[0][0]    
__________________________________________________________________________________________________
conv2d_146 (Conv2D)             (1024, 16, 16, 64)   8256        activation_137[0][0]             
__________________________________________________________________________________________________
batch_normalization_138 (BatchN (1024, 16, 16, 64)   256         conv2d_146[0][0]                 
__________________________________________________________________________________________________
activation_138 (Activation)     (1024, 16, 16, 64)   0           batch_normalization_138[0][0]    
__________________________________________________________________________________________________
conv2d_147 (Conv2D)             (1024, 16, 16, 64)   36928       activation_138[0][0]             
__________________________________________________________________________________________________
batch_normalization_139 (BatchN (1024, 16, 16, 64)   256         conv2d_147[0][0]                 
__________________________________________________________________________________________________
activation_139 (Activation)     (1024, 16, 16, 64)   0           batch_normalization_139[0][0]    
__________________________________________________________________________________________________
conv2d_148 (Conv2D)             (1024, 16, 16, 128)  8320        activation_139[0][0]             
__________________________________________________________________________________________________
add_45 (Add)                    (1024, 16, 16, 128)  0           add_44[0][0]                     
                                                                 conv2d_148[0][0]                 
__________________________________________________________________________________________________
batch_normalization_140 (BatchN (1024, 16, 16, 128)  512         add_45[0][0]                     
__________________________________________________________________________________________________
activation_140 (Activation)     (1024, 16, 16, 128)  0           batch_normalization_140[0][0]    
__________________________________________________________________________________________________
conv2d_149 (Conv2D)             (1024, 16, 16, 64)   8256        activation_140[0][0]             
__________________________________________________________________________________________________
batch_normalization_141 (BatchN (1024, 16, 16, 64)   256         conv2d_149[0][0]                 
__________________________________________________________________________________________________
activation_141 (Activation)     (1024, 16, 16, 64)   0           batch_normalization_141[0][0]    
__________________________________________________________________________________________________
conv2d_150 (Conv2D)             (1024, 16, 16, 64)   36928       activation_141[0][0]             
__________________________________________________________________________________________________
batch_normalization_142 (BatchN (1024, 16, 16, 64)   256         conv2d_150[0][0]                 
__________________________________________________________________________________________________
activation_142 (Activation)     (1024, 16, 16, 64)   0           batch_normalization_142[0][0]    
__________________________________________________________________________________________________
conv2d_151 (Conv2D)             (1024, 16, 16, 128)  8320        activation_142[0][0]             
__________________________________________________________________________________________________
add_46 (Add)                    (1024, 16, 16, 128)  0           add_45[0][0]                     
                                                                 conv2d_151[0][0]                 
__________________________________________________________________________________________________
batch_normalization_143 (BatchN (1024, 16, 16, 128)  512         add_46[0][0]                     
__________________________________________________________________________________________________
activation_143 (Activation)     (1024, 16, 16, 128)  0           batch_normalization_143[0][0]    
__________________________________________________________________________________________________
conv2d_152 (Conv2D)             (1024, 16, 16, 64)   8256        activation_143[0][0]             
__________________________________________________________________________________________________
batch_normalization_144 (BatchN (1024, 16, 16, 64)   256         conv2d_152[0][0]                 
__________________________________________________________________________________________________
activation_144 (Activation)     (1024, 16, 16, 64)   0           batch_normalization_144[0][0]    
__________________________________________________________________________________________________
conv2d_153 (Conv2D)             (1024, 16, 16, 64)   36928       activation_144[0][0]             
__________________________________________________________________________________________________
batch_normalization_145 (BatchN (1024, 16, 16, 64)   256         conv2d_153[0][0]                 
__________________________________________________________________________________________________
activation_145 (Activation)     (1024, 16, 16, 64)   0           batch_normalization_145[0][0]    
__________________________________________________________________________________________________
conv2d_154 (Conv2D)             (1024, 16, 16, 128)  8320        activation_145[0][0]             
__________________________________________________________________________________________________
add_47 (Add)                    (1024, 16, 16, 128)  0           add_46[0][0]                     
                                                                 conv2d_154[0][0]                 
__________________________________________________________________________________________________
batch_normalization_146 (BatchN (1024, 16, 16, 128)  512         add_47[0][0]                     
__________________________________________________________________________________________________
activation_146 (Activation)     (1024, 16, 16, 128)  0           batch_normalization_146[0][0]    
__________________________________________________________________________________________________
conv2d_155 (Conv2D)             (1024, 8, 8, 128)    16512       activation_146[0][0]             
__________________________________________________________________________________________________
batch_normalization_147 (BatchN (1024, 8, 8, 128)    512         conv2d_155[0][0]                 
__________________________________________________________________________________________________
activation_147 (Activation)     (1024, 8, 8, 128)    0           batch_normalization_147[0][0]    
__________________________________________________________________________________________________
conv2d_156 (Conv2D)             (1024, 8, 8, 128)    147584      activation_147[0][0]             
__________________________________________________________________________________________________
batch_normalization_148 (BatchN (1024, 8, 8, 128)    512         conv2d_156[0][0]                 
__________________________________________________________________________________________________
activation_148 (Activation)     (1024, 8, 8, 128)    0           batch_normalization_148[0][0]    
__________________________________________________________________________________________________
conv2d_158 (Conv2D)             (1024, 8, 8, 256)    33024       add_47[0][0]                     
__________________________________________________________________________________________________
conv2d_157 (Conv2D)             (1024, 8, 8, 256)    33024       activation_148[0][0]             
__________________________________________________________________________________________________
add_48 (Add)                    (1024, 8, 8, 256)    0           conv2d_158[0][0]                 
                                                                 conv2d_157[0][0]                 
__________________________________________________________________________________________________
batch_normalization_149 (BatchN (1024, 8, 8, 256)    1024        add_48[0][0]                     
__________________________________________________________________________________________________
activation_149 (Activation)     (1024, 8, 8, 256)    0           batch_normalization_149[0][0]    
__________________________________________________________________________________________________
conv2d_159 (Conv2D)             (1024, 8, 8, 128)    32896       activation_149[0][0]             
__________________________________________________________________________________________________
batch_normalization_150 (BatchN (1024, 8, 8, 128)    512         conv2d_159[0][0]                 
__________________________________________________________________________________________________
activation_150 (Activation)     (1024, 8, 8, 128)    0           batch_normalization_150[0][0]    
__________________________________________________________________________________________________
conv2d_160 (Conv2D)             (1024, 8, 8, 128)    147584      activation_150[0][0]             
__________________________________________________________________________________________________
batch_normalization_151 (BatchN (1024, 8, 8, 128)    512         conv2d_160[0][0]                 
__________________________________________________________________________________________________
activation_151 (Activation)     (1024, 8, 8, 128)    0           batch_normalization_151[0][0]    
__________________________________________________________________________________________________
conv2d_161 (Conv2D)             (1024, 8, 8, 256)    33024       activation_151[0][0]             
__________________________________________________________________________________________________
add_49 (Add)                    (1024, 8, 8, 256)    0           add_48[0][0]                     
                                                                 conv2d_161[0][0]                 
__________________________________________________________________________________________________
batch_normalization_152 (BatchN (1024, 8, 8, 256)    1024        add_49[0][0]                     
__________________________________________________________________________________________________
activation_152 (Activation)     (1024, 8, 8, 256)    0           batch_normalization_152[0][0]    
__________________________________________________________________________________________________
conv2d_162 (Conv2D)             (1024, 8, 8, 128)    32896       activation_152[0][0]             
__________________________________________________________________________________________________
batch_normalization_153 (BatchN (1024, 8, 8, 128)    512         conv2d_162[0][0]                 
__________________________________________________________________________________________________
activation_153 (Activation)     (1024, 8, 8, 128)    0           batch_normalization_153[0][0]    
__________________________________________________________________________________________________
conv2d_163 (Conv2D)             (1024, 8, 8, 128)    147584      activation_153[0][0]             
__________________________________________________________________________________________________
batch_normalization_154 (BatchN (1024, 8, 8, 128)    512         conv2d_163[0][0]                 
__________________________________________________________________________________________________
activation_154 (Activation)     (1024, 8, 8, 128)    0           batch_normalization_154[0][0]    
__________________________________________________________________________________________________
conv2d_164 (Conv2D)             (1024, 8, 8, 256)    33024       activation_154[0][0]             
__________________________________________________________________________________________________
add_50 (Add)                    (1024, 8, 8, 256)    0           add_49[0][0]                     
                                                                 conv2d_164[0][0]                 
__________________________________________________________________________________________________
batch_normalization_155 (BatchN (1024, 8, 8, 256)    1024        add_50[0][0]                     
__________________________________________________________________________________________________
activation_155 (Activation)     (1024, 8, 8, 256)    0           batch_normalization_155[0][0]    
__________________________________________________________________________________________________
conv2d_165 (Conv2D)             (1024, 8, 8, 128)    32896       activation_155[0][0]             
__________________________________________________________________________________________________
batch_normalization_156 (BatchN (1024, 8, 8, 128)    512         conv2d_165[0][0]                 
__________________________________________________________________________________________________
activation_156 (Activation)     (1024, 8, 8, 128)    0           batch_normalization_156[0][0]    
__________________________________________________________________________________________________
conv2d_166 (Conv2D)             (1024, 8, 8, 128)    147584      activation_156[0][0]             
__________________________________________________________________________________________________
batch_normalization_157 (BatchN (1024, 8, 8, 128)    512         conv2d_166[0][0]                 
__________________________________________________________________________________________________
activation_157 (Activation)     (1024, 8, 8, 128)    0           batch_normalization_157[0][0]    
__________________________________________________________________________________________________
conv2d_167 (Conv2D)             (1024, 8, 8, 256)    33024       activation_157[0][0]             
__________________________________________________________________________________________________
add_51 (Add)                    (1024, 8, 8, 256)    0           add_50[0][0]                     
                                                                 conv2d_167[0][0]                 
__________________________________________________________________________________________________
batch_normalization_158 (BatchN (1024, 8, 8, 256)    1024        add_51[0][0]                     
__________________________________________________________________________________________________
activation_158 (Activation)     (1024, 8, 8, 256)    0           batch_normalization_158[0][0]    
__________________________________________________________________________________________________
conv2d_168 (Conv2D)             (1024, 8, 8, 128)    32896       activation_158[0][0]             
__________________________________________________________________________________________________
batch_normalization_159 (BatchN (1024, 8, 8, 128)    512         conv2d_168[0][0]                 
__________________________________________________________________________________________________
activation_159 (Activation)     (1024, 8, 8, 128)    0           batch_normalization_159[0][0]    
__________________________________________________________________________________________________
conv2d_169 (Conv2D)             (1024, 8, 8, 128)    147584      activation_159[0][0]             
__________________________________________________________________________________________________
batch_normalization_160 (BatchN (1024, 8, 8, 128)    512         conv2d_169[0][0]                 
__________________________________________________________________________________________________
activation_160 (Activation)     (1024, 8, 8, 128)    0           batch_normalization_160[0][0]    
__________________________________________________________________________________________________
conv2d_170 (Conv2D)             (1024, 8, 8, 256)    33024       activation_160[0][0]             
__________________________________________________________________________________________________
add_52 (Add)                    (1024, 8, 8, 256)    0           add_51[0][0]                     
                                                                 conv2d_170[0][0]                 
__________________________________________________________________________________________________
batch_normalization_161 (BatchN (1024, 8, 8, 256)    1024        add_52[0][0]                     
__________________________________________________________________________________________________
activation_161 (Activation)     (1024, 8, 8, 256)    0           batch_normalization_161[0][0]    
__________________________________________________________________________________________________
conv2d_171 (Conv2D)             (1024, 8, 8, 128)    32896       activation_161[0][0]             
__________________________________________________________________________________________________
batch_normalization_162 (BatchN (1024, 8, 8, 128)    512         conv2d_171[0][0]                 
__________________________________________________________________________________________________
activation_162 (Activation)     (1024, 8, 8, 128)    0           batch_normalization_162[0][0]    
__________________________________________________________________________________________________
conv2d_172 (Conv2D)             (1024, 8, 8, 128)    147584      activation_162[0][0]             
__________________________________________________________________________________________________
batch_normalization_163 (BatchN (1024, 8, 8, 128)    512         conv2d_172[0][0]                 
__________________________________________________________________________________________________
activation_163 (Activation)     (1024, 8, 8, 128)    0           batch_normalization_163[0][0]    
__________________________________________________________________________________________________
conv2d_173 (Conv2D)             (1024, 8, 8, 256)    33024       activation_163[0][0]             
__________________________________________________________________________________________________
add_53 (Add)                    (1024, 8, 8, 256)    0           add_52[0][0]                     
                                                                 conv2d_173[0][0]                 
__________________________________________________________________________________________________
batch_normalization_164 (BatchN (1024, 8, 8, 256)    1024        add_53[0][0]                     
__________________________________________________________________________________________________
activation_164 (Activation)     (1024, 8, 8, 256)    0           batch_normalization_164[0][0]    
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (1024, 1, 1, 256)    0           activation_164[0][0]             
__________________________________________________________________________________________________
flatten_2 (Flatten)             (1024, 256)          0           average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
dense_2 (Dense)                 (1024, 100)          25700       flatten_2[0][0]                  
==================================================================================================
Total params: 1,696,868
Trainable params: 1,686,468
Non-trainable params: 10,400
__________________________________________________________________________________________________